python_einops.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-01-07 Sat 21:59 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Python - Einops</title>
<meta name="author" content="shaka" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="default.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Python - Einops</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org31d0d9d">Installation</a></li>
<li><a href="#orgb04da37">Usage</a>
<ul>
<li><a href="#org2eafd28">Basic functions</a>
<ul>
<li><a href="#org5ed6b12"><code>rearrange</code></a></li>
<li><a href="#orge0361f3"><code>reduce</code></a></li>
<li><a href="#org233577e"><code>repeat</code></a></li>
</ul>
</li>
<li><a href="#orgd395966">Layers</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Einstein-inspired notation for operations (Einops<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>) is a python package which provides extremely flexible and powerful opertions on tensors, e.g., permuting/reordering, reshaping (combining and partitioning along axes), reducing, repeating. Moreover, it supports numpy, tensorflow, pytorch, etc.
</p>

<div id="outline-container-org31d0d9d" class="outline-2">
<h2 id="org31d0d9d">Installation</h2>
<div class="outline-text-2" id="text-org31d0d9d">
<p>
Einops can be directly installed from pypi.
</p>
<div class="org-src-container">
<pre class="src src-shell">pip install einops
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb04da37" class="outline-2">
<h2 id="orgb04da37">Usage</h2>
<div class="outline-text-2" id="text-orgb04da37">
</div>
<div id="outline-container-org2eafd28" class="outline-3">
<h3 id="org2eafd28">Basic functions</h3>
<div class="outline-text-3" id="text-org2eafd28">
<p>
Basically, Einops provides 3 Functions, <code>rearrange</code>, <code>reduce</code>, <code>repeat</code>, which can be imported by
</p>
<div class="org-src-container">
<pre class="src src-python">from einops import rearrange, reduce, repeat

rearrange(tensor, pattern: str, **axes_lengths)
reduce(tensor: ~Tensor, pattern: str, reduction: Union[str, Callable[[~Tensor, List[int]], ~Tensor]], **axes_lengths: int) -&gt; ~Tensor
repeat(tensor: ~Tensor, pattern: str, **axes_lengths) -&gt; ~Tensor
</pre>
</div>
<ul class="org-ul">
<li><code>tensor</code> is a tensor (e.g., <code>numpy.ndarray</code>, <code>tensorflow</code>, <code>pytorch</code>) or a list of tensors with the same type and shape.</li>
<li><code>pattern</code> is a string indicating rearrangement/reduction pattern.</li>
<li><code>reduction</code> can be one of <code>'max'</code>, <code>'min'</code>, <code>'mean'</code>, <code>'sum'</code>, <code>'prod'</code>.</li>
<li><code>axes_lengths</code> are dimension related specifications.</li>
</ul>
</div>
<div id="outline-container-org5ed6b12" class="outline-4">
<h4 id="org5ed6b12"><code>rearrange</code></h4>
<div class="outline-text-4" id="text-org5ed6b12">
<p>
<code>rearrange</code> does not change the number of elements inside, and can achieve the operations like transpose, reshape, stack, squeeze, unsqueeze, concatenate, etc.
</p>
</div>
</div>
<div id="outline-container-orge0361f3" class="outline-4">
<h4 id="orge0361f3"><code>reduce</code></h4>
<div class="outline-text-4" id="text-orge0361f3">
<p>
<code>reduce</code> combines elements in one or more axes. So it reduces the total number of elements, but keeps the ordering.
</p>
</div>
</div>
<div id="outline-container-org233577e" class="outline-4">
<h4 id="org233577e"><code>repeat</code></h4>
<div class="outline-text-4" id="text-org233577e">
<p>
<code>repeat</code> produces repetition and tiling.
</p>
</div>
</div>
</div>
<div id="outline-container-orgd395966" class="outline-3">
<h3 id="orgd395966">Layers</h3>
<div class="outline-text-3" id="text-orgd395966">
<p>
Einops also provides two corresponding layers, which can be directly integrated into any neural network.
</p>
<div class="org-src-container">
<pre class="src src-python">from einops.layers.chainer import Rearrange, Reduce
from einops.layers.gluon import Rearrange, Reduce
from einops.layers.keras import Rearrange, Reduce
from einops.layers.torch import Rearrange, Reduce
from einops.layers.tensorflow import Rearrange, Reduce
</pre>
</div>
<p>
Taking pytorch for instace, a <code>Rearrange</code> layer or a <code>Reduce</code> layer can be generated by
</p>
<div class="org-src-container">
<pre class="src src-python">Rearrange(pattern, **axes_lengths)
Reduce(pattern, reduction, **axes_lengths)
</pre>
</div>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
<a href="https://github.com/arogozhnikov/einops">https://github.com/arogozhnikov/einops</a> 
</p></div></div>


</div>
</div></div>
</body>
</html>